#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:t todo:t |:t
#+TITLE: orion-muse
#+AUTHOR: William Henney
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+TODO: TODO NEXT STARTED | DONE CANCELED
*** Program to extract a single line extract-em-line.py
+ First go
  + Choose wavelength range around line
    + [ ]This should come from a velocity range really
  + Extract cube that is just the line
+ Revisited [2015-10-29 Thu]
  + We want to add "fuzzed" versions of the maps in which we add gaussian noise made from the variance
  + First we refactor the original extract-em-line.py so that it separates the finding of the wavelength window from the line extraction proper
  + This is because we don't want to fuzz the entire wavsec cube
  + The idea is that we will be able to re-use parts in the fuzz version


#+BEGIN_SRC python :tangle extract_utils.py
  from __future__ import print_function
  import sys
  import numpy as np
  from astropy.table import Table
  from astropy.io import fits
  from astropy.wcs import WCS
  from astropy import units as u
  from misc_utils import sanitize_string
  sys.path.append('/Users/will/Dropbox/OrionWest/')
  from helio_utils import waves2vels


  linetab = Table.read('basic-line-list.tab', format='ascii.tab')
  wavsectab = Table.read('wavsec-startwavs.tab', format='ascii.tab')

  def find_wavsec(wav):
      """Which wavsec chunk is this wavelength in"""
      return wavsectab['Section'][wav > wavsectab['CRVAL3']].max() 



#+END_SRC

#+BEGIN_SRC python :tangle extract-em-line.py
  from __future__ import print_function
  import sys
  import numpy as np
  from astropy.table import Table
  from astropy.io import fits
  from astropy.wcs import WCS
  from astropy import units as u
  from misc_utils import sanitize_string
  sys.path.append('/Users/will/Dropbox/OrionWest/')
  from helio_utils import waves2vels

  linetab = Table.read('basic-line-list.tab', format='ascii.tab')
  wavsectab = Table.read('wavsec-startwavs.tab', format='ascii.tab')

  def find_wavsec(wav):
      """Which wavsec chunk is this wavelength in"""
      return wavsectab['Section'][wav > wavsectab['CRVAL3']].max() 


  def save_linemap_files(wav, species, mapdir='LineMaps', usecont=[1, 1]):
      wavsec = find_wavsec(wav)
      wavsec_blue = find_wavsec(wav - 8.0)
      wavsec_red = find_wavsec(wav + 8.0)
      if (wavsec_blue != wavsec) or (wavsec_red != wavsec):
          print('Uh, oh - line straddles wavsecs', wavsec_blue, wavsec, wavsec_red)
          if 5000.0 < wav < 6000.0:
              print('But luckily we can use F547M window instead')
              fn = 'muse-hr-window-wfc3-f547m.fits'
          else:
              sys.exit('Unable to find a cube that contains wavelength range - sorry!')
      else:
          fn = 'muse-hr-data-wavsec{}.fits'.format(wavsec)
      hdulist = fits.open(fn)
      hdu = hdulist['DATA']
      w = WCS(hdu.header)
      helio_hdr = fits.open('muse-hr-window-wfc3-f656n.fits')[0].header
      maps, spec =  extract_line_maps(wav, hdu.data, w, helio_hdr, usecont)
      wavid = str(int(wav+0.5))
      # Save the maps to FITS file 
      for mapid, mapdata in maps.items():
          mhdu = fits.PrimaryHDU(header=w.celestial.to_header(), data=mapdata)
          mname = '{}/{}-{}-{}.fits'.format(mapdir, mapid, species, wavid)
          mhdu.writeto(mname, clobber=True)
      sname = '{}/spec1d-{}-{}.tab'.format(mapdir, species, wavid)
      # And save the spectrum to TSV file
      Table(spec).write(sname, format='ascii.tab')

  def extract_line_maps(wav, cube, wcube, helio_hdr,
                        usecont=[1, 1], dwav=4.0, dwavcont=8.0):
      """Extract line moments and continuum"""

      # outer range is wav +/- dwavcont
      wavs = (wav + dwavcont*np.array([-1, 1]))*u.Angstrom.to(u.m)
      _, _, (kout1, kout2) = wcube.all_world2pix([0, 0], [0, 0], wavs, 0)
      kout1, kout2 = int(kout1), int(kout2) + 2

      # inner range is wav +/- dwav
      wavs = (wav + dwav*np.array([-1, 1]))*u.Angstrom.to(u.m)
      _, _, (kin1, kin2) = wcube.all_world2pix([0, 0], [0, 0], wavs, 0)
      kin1, kin2 = int(kin1), int(kin2) + 2

      # find average continuum
      cont1 = np.nanmean(cube[kout1:kin1, :, :], axis=0)
      cont2 = np.nanmean(cube[kin2:kout2, :, :], axis=0)
      # Maybe don't use the continuum on one side (if contaminated)
      wt1, wt2 = usecont          
      avcont = (wt1*cont1 + wt2*cont2)/(wt1 + wt2)

      # Subtract to get pure line window
      linewin = cube[kin1:kin2, :, :] - avcont[None, :, :]
      # Now find moments
      nwin = kin2 - kin1
      _, _, winwavs = wcube.all_pix2world([0]*nwin, [0]*nwin, np.arange(kin1, kin2), 0)
      # Convert wavelengths to velocities
      winvels = waves2vels(winwavs*u.m.to(u.Angstrom), wav, helio_hdr, observatory='VLT4')
      mom0 = linewin.sum(axis=0)
      mom1 = np.sum(linewin*winvels[:, None, None], axis=0)
      vmean = mom1/mom0
      mom2 = np.sum(linewin*(winvels[:, None, None] - vmean)**2, axis=0)
      vsig = np.sqrt(mom2/mom0)
      maps = {'continuum': avcont, 'linesum': mom0,
              'mean': vmean.to(u.km/u.s).value, 'sigma': vsig.to(u.km/u.s).value}

      # Save an average spectrum as well
      nwinout = kout2 - kout1
      _, _, winwavsout = wcube.all_pix2world([0]*nwinout, [0]*nwinout, np.arange(kout1, kout2), 0)
      winvelsout = waves2vels(winwavsout*u.m.to(u.Angstrom), wav, helio_hdr, observatory='VLT4')

      # Just select region to SW of Trap
      xslice = slice(900, 1400)
      yslice = slice(400, 900)
      spec = {
          'vhel': winvelsout.to(u.km/u.s),
          'wav': winwavsout*u.m.to(u.Angstrom),
          'flux': np.nanmean(cube[kout1:kout2, yslice, xslice], axis=(1, 2)),
          'cont': np.nanmean(avcont[yslice, xslice])*np.ones(nwinout),
      }

      return maps, spec


  for row in linetab:
      print(row['Ion'], row['wav0'])
      save_linemap_files(row['wav0'], sanitize_string(row['Ion']),
                         usecont=[row['blue cont'], row['red cont']])

#+END_SRC

#+BEGIN_SRC sh :results silent
mkdir LineMaps
#+END_SRC

Test it out in a shell
#+BEGIN_SRC sh :eval no
  python extract-em-line.py
#+END_SRC

Check out the heliocentric correction
#+BEGIN_SRC python :results output
  from __future__ import print_function
  import sys
  from astropy.io import fits
  sys.path.append('/Users/will/Dropbox/OrionWest/')
  from helio_utils import helio_topo_from_header

  hdr = fits.open('muse-hr-window-wfc3-f656n.fits')[0].header
  print(helio_topo_from_header(hdr, observatory='VLT4'))
#+END_SRC

#+RESULTS:
: -16.217273731
** DONE Two-D histogram of MUSE synthetic filter vs MUSE true line ratios
CLOSED: [2015-10-22 Thu 17:21]
#+BEGIN_SRC python :tangle histo-muse-ratios.py
  from __future__ import print_function
  import numpy as np
  from astropy.io import fits
  from astropy.convolution import convolve, Gaussian2DKernel
  from matplotlib import pyplot as plt
  import seaborn as sns
  from specplot1d_utils import plot_1d_spec_from_fits


  plotpars = {
      '6716-6731': {'line1': '[S II] 6716', 'line2': '[S II] 6731',
                    'min': 0.4, 'max': 1.1},
      '6716-6731-N': {'line1': '[S II] 6716', 'line2': '[S II] 6731',
                    'min': 0.4, 'max': 1.1},
      '5755-6583': {'line1': '[N II] 5755', 'line2': '[N II] 6583',
                    'min': 0.0, 'max': 0.04},
      '4861-6563': {'line1': 'H I 4861', 'line2': 'H I 6563',
                    'min': 0.15, 'max': 0.35},
    }

  titles_from_extra = {
      '': 'Fully continuum-corrected with color terms',
      '-naive': 'Uncorrected for continuum',
      '-flat': 'Partially continuum-corrected but without color terms',
  }

  GAMMA = 1.0

  cmap = sns.light_palette((260, 50, 30), input="husl", as_cmap=True)
  # cmap = plt.cm.gray_r

  def histogram_ratio_images(ratio_name, pars, extra=''):
      ratio_name_true = '-'.join(ratio_name.split('-')[:2])
      fn_true = 'LineMaps/ratio-{}.fits'.format(ratio_name_true)
      fn_syn = 'NebulioMUSE/synthetic{}-ratio-{}.fits'.format(extra, ratio_name)
      pltname = 'NebulioMUSE/synthetic{}-vs-true-calib-{}.pdf'.format(extra, ratio_name)
      hdu_true = fits.open(fn_true)[0]
      hdu_syn = fits.open(fn_syn)[0]
      # Flux of a strong line to weight the pixels
      hduf = fits.open('LineMaps/linesum-N_II-6583.fits')[0]
      x, y, w = hdu_true.data, hdu_syn.data, hduf.data
      xmin, xmax = ymin, ymax = pars['min'], pars['max']
      # mask out silly values
      m = np.isfinite(x) & np.isfinite(y/x) & (np.abs(np.log10(y/x)) < 1.0)
      H, xedges, yedges = np.histogram2d(x[m], y[m], 400,
                                         [[xmin, xmax], [ymin, ymax]],
                                         weights=w[m])
      fig, ax = plt.subplots(1, 1)
      ax.imshow((H.T)**(1.0/GAMMA), extent=[xmin, xmax, ymin, ymax],
                interpolation='nearest', aspect='auto', origin='lower', 
                cmap=cmap, alpha=1.0)
      ax.plot([xmin, xmax], [xmin, xmax], '-', alpha=1.0,
              lw=1, c='r', label=None)
      ax.set_xlabel(
          'MUSE spectrum-derived line ratio: {} / {}'.format(
              pars['line1'], pars['line2']))
      ax.set_ylabel(
          'MUSE synthetic WFC3 filter-derived line ratio: {} / {}'.format(
              pars['line1'], pars['line2']))
      ax.set_xlim(xmin, xmax)
      ax.set_ylim(ymin, ymax)
      ax.text(0.3, 0.05, titles_from_extra[extra], transform=ax.transAxes)

      fig.set_size_inches(7, 7)
      fig.savefig(pltname)

      return pltname


  if __name__ == '__main__':
      for ratio_name, pars in plotpars.items():
          for extra in '', '-naive', '-flat':
              print(histogram_ratio_images(ratio_name, pars, extra))

#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :results verbatim
python histo-muse-ratios.py
#+END_SRC

#+RESULTS:
#+begin_example
NebulioMUSE/synthetic-vs-true-calib-6716-6731.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-6716-6731.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-6716-6731.pdf
NebulioMUSE/synthetic-vs-true-calib-6716-6731-N.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-6716-6731-N.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-6716-6731-N.pdf
NebulioMUSE/synthetic-vs-true-calib-4861-6563.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-4861-6563.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-4861-6563.pdf
NebulioMUSE/synthetic-vs-true-calib-5755-6583.pdf
NebulioMUSE/synthetic-naive-vs-true-calib-5755-6583.pdf
NebulioMUSE/synthetic-flat-vs-true-calib-5755-6583.pdf
#+end_example

#+BEGIN_SRC sh :result silent
open NebulioMUSE/synthetic-vs-true-calib-*.pdf
open NebulioMUSE/synthetic-naive-vs-true-calib-*.pdf
open NebulioMUSE/synthetic-flat-vs-true-calib-*.pdf
#+END_SRC

#+RESULTS:

#+RESULTS

** DONE Now compare synthetic filter-derived ratios with real WFC3 filter-derived ones
CLOSED: [2015-10-22 Thu 17:21]
:LOGBOOK:
CLOCK: [2015-10-21 Wed 21:19]--[2015-10-22 Thu 00:27] =>  3:08
:END:
+ [2015-10-21 Wed] I have using DS9
  + MUSE :: synthetic-ratio-5755-6583.fits
  + WFC3 :: newratio-5755-6583.fits
+ This works tolerably well now


* Calibration of WFC3 filter using MUSE cube
:LOGBOOK:
CLOCK: [2015-10-07 Wed 09:58]--[2015-10-07 Wed 11:58] =>  2:00
:END:
+ The interesting sections are wavsec0 to wavsec3

**** DONE [1/1] Print out the mean wavelength and rectangular width of each filter
CLOSED: [2015-10-08 Thu 11:25]
#+name: extract-bandpasses 
#+BEGIN_SRC python :return outtab
  import pysynphot
  from astropy.table import Table
  <<bandpass-fullname-function>>
  float_fmt = '{:.2f}'
  intab = Table.read('all-filters-input.tab', format='ascii.tab')
  outtab = [['Filter', 'Wav0', 'dWav'], None]
  for row in intab:
      fn = bp_fullname(row['Instrument'], row['Filter'])
      bp = pysynphot.ObsBandpass(fn)
      outtab.append([fn, float_fmt.format(bp.avgwave()), float_fmt.format(bp.rectwidth())])
#+END_SRC

#+RESULTS: extract-bandpasses
| Filter            |    Wav0 |    dWav |
|-------------------+---------+---------|
| wfc3,uvis1,fq436n | 4367.22 |   43.36 |
| wfc3,uvis1,fq437n | 4371.09 |   29.99 |
| wfc3,uvis1,f469n  | 4688.14 |   49.67 |
| wfc3,uvis1,f487n  | 4871.42 |   60.41 |
| wfc3,uvis1,f502n  | 5009.71 |   65.27 |
| wfc3,uvis1,f547m  | 5451.37 |  649.89 |
| wfc3,uvis1,fq575n | 5757.87 |   18.37 |
| wfc3,uvis1,f656n  | 6561.44 |   17.65 |
| wfc3,uvis1,f658n  | 6584.91 |   27.55 |
| wfc3,uvis1,fq672n | 6716.62 |   19.37 |
| wfc3,uvis1,f673n  | 6766.04 |  117.78 |
| wfc3,uvis1,fq674n | 6730.77 |   17.63 |
| wfpc2,f437n       | 4369.57 |   31.84 |
| wfpc2,f469n       | 4694.55 |   33.10 |
| wfpc2,f487n       | 4865.48 |   33.93 |
| wfpc2,f502n       | 5013.41 |   35.80 |
| wfpc2,f547m       | 5487.62 |  638.11 |
| wfpc2,f631n       | 6306.45 |   42.14 |
| wfpc2,f656n       | 6563.57 |   28.34 |
| wfpc2,f658n       | 6590.91 |   39.24 |
| wfpc2,f673n       | 6732.30 |   63.31 |
| acs,wfc1,f658n    | 6584.05 |   74.94 |
| acs,wfc1,f660n    | 6599.50 |   35.69 |
| acs,wfc1,f435w    | 4338.43 |  862.30 |
| acs,wfc1,f555w    | 5373.22 | 1124.61 |
| acs,wfc1,f775w    | 7705.71 | 1320.72 |
| acs,wfc1,f850lp   | 9049.59 | 1261.35 |

+ [X] Test that this works on linux server



**** Fold the spectra through each filter to get simulated images
This does not have to be done on the server any more

#+BEGIN_SRC python :tangle filter-flatten.py 
  from __future__ import print_function
  import sys
  <<astro-imports>>
  <<air-refractive-index>>
  <<bandpass-fullname-function>>
  <<flux-to-counts>>

  def bandpass_flatten(instrument, bpname):
      filename = 'muse-hr-window-{}-{}.fits'.format(instrument, bpname)
      hdulist = fits.open(filename)
      hdu = hdulist['DATA']
      w = wcs.WCS(hdu.header)
      NV, NY, NX = hdu.data.shape
      # construct array of observed air wavelengths (at image center to be safe)
      _, _, wavs = w.all_pix2world([NX/2]*NV, [NY/2]*NV, np.arange(NV), 0) 
      # Make dimensional
      wavs *= u.m
      # Convert to vacuum scale
      wavs *= air_refractive_index(wavs)

      # Get bandpass for filter
      fn = bp_fullname(instrument, bpname)
      bp = pysynphot.ObsBandpass(fn)
      # Calculate transmission curve at the observed wavelengths
      T = bp(wavs.to(u.Angstrom).value)
      # Weight by transmission curve and save that
      hdu.data *= T[:, None, None]
      hdulist.writeto(filename.replace('-window-', '-transwin-'), clobber=True)
      # Integrate over wavelength, already weighted by transmission curve. But
      # now need to multiply by wavelength, put in brightness units, and
      # convert to WFC3 electron/s/pixel
      hdu.data *= WFC3_CONSTANT*MUSE_FLUX_UNITS/MUSE_PIXEL_AREA_SR
      hdu.data *= wavs.to(u.Angstrom).value[:, None, None]
      hdu.data = hdu.header['CDELT3']*np.sum(hdu.data, axis=0)
      hdu.header['BUNIT'] = 'electron/s/(0.03962 arcsec)**2'
      hdulist.writeto(filename.replace('-window-', '-image-'), clobber=True)

  if __name__ == '__main__':
      try:
          instrument, bpname = sys.argv[1:]
          bandpass_flatten(instrument, bpname)
      except IndexError:
          print('Usage:', sys.argv[0], 'INSTRUMENT FILTER')
  
#+END_SRC

New example of use, using STSCI python on laptop
#+BEGIN_SRC sh :results silent
source ~/.bash_profile
ur_setup
export PYSYN_CDBS=/Users/will/Dropbox/CDBS
python filter-flatten.py wfc3 fq575n
#+END_SRC


Check the same one using the Anaconda py27 on hypatia, but make sure that we are using the same version of CDBS
#+BEGIN_SRC sh :results silent
source activate py27
export PYSYN_CDBS=/Users/will/Dropbox/CDBS
python filter-flatten.py wfc3 fq575n
#+END_SRC
Exactly the same, which is a heartening.  

Now do it for all the filters
#+BEGIN_SRC sh
  source activate py27
  export PYSYN_CDBS=/Users/will/Dropbox/CDBS
  FILTERS="f469n f487n f502n f547m fq575n f656n f658n fq672n f673n fq674n"
  for f in $FILTERS; do
      echo Flattening $f
      python filter-flatten.py wfc3 $f
  done
#+END_SRC

#+RESULTS:
| Flattening | f469n  |
| Flattening | f487n  |
| Flattening | f502n  |
| Flattening | f547m  |
| Flattening | fq575n |
| Flattening | f656n  |
| Flattening | f658n  |
| Flattening | fq672n |
| Flattening | f673n  |
| Flattening | fq674n |
*** DONE Testing out Montage
CLOSED: [2015-10-14 Wed 09:10]
#+BEGIN_SRC sh :results verbatim
PATH=$PATH:~/Source/Montage/bin
err=$(mProjectPP --help)
echo $err
#+END_SRC

#+RESULTS:
: [struct stat="ERROR", msg="Usage: mProjectPP [-z factor][-d level][-b border][-s statusfile][-o altout.hdr][-i altin.hdr][-h hdu][-x scale][-w weightfile][-t threshold][-X(expand)] in.fits out.fits template.hdr"]
*** DONE Script to resample WFC3 image onto MUSE grid
CLOSED: [2015-10-14 Wed 09:12]
+ Header for MUSE full frame grid: [[file:muse-full-frame.hdr]]
+ This does not expand the WFC3 image beyond its original borders
  + So we will have to extract a section of the MUSE image for comparison
  + On the other hand, it does maintain the same reference pixel
    + But with different values of CRPIX because the image lower left corner is different
    + So it has the same values of CRVAL
    + This will make it easy to slice the MUSE image
+ Smoothing needs to be improved
  + No smoothing is too little
  + The =s120= images that I already have are too much (this was 1.2 arcsec I assume)
  + In the [[id:2E0AC321-C544-4E65-9D59-9A11F96E94BD][t2 notes]] I calculated FWHM of 4 pixels = 0.8 arcsec
  + Actually 0.7 arcsec was better - this is now done in [[id:0CF5E394-36D0-4589-9E02-93EEDE7CF151][the orion-t2.org notes]]
#+BEGIN_SRC sh :tangle wfc3-resample-to-muse.sh
F=$1
MDIR=~/Source/Montage/bin
TDIR=~/Work/RubinWFC3/Tsquared
$MDIR/mProjectPP -h 0 -X $TDIR/full_${F}-s070.fits wfc3-resample-muse-$F.fits muse-full-frame.hdr
#+END_SRC

Test with a single image
#+BEGIN_SRC sh :results verbatim
time sh wfc3-resample-to-muse.sh F547M 2>&1 
#+END_SRC

#+RESULTS:
: [struct stat="OK", time=3]


Do all of the images
#+BEGIN_SRC sh :results verbatim
  FILTERS="f469n f487n f502n f547m fq575n f656n f658n fq672n f673n fq674n"
  for f in $FILTERS; do
      echo "Resampling $f"
      time sh wfc3-resample-to-muse.sh $f
  done
#+END_SRC

#+RESULTS:
#+begin_example
Resampling f469n
[struct stat="OK", time=4]
Resampling f487n
[struct stat="OK", time=3]
Resampling f502n
[struct stat="OK", time=5]
Resampling f547m
[struct stat="OK", time=4]
Resampling fq575n
[struct stat="OK", time=4]
Resampling f656n
[struct stat="OK", time=5]
Resampling f658n
[struct stat="OK", time=4]
Resampling fq672n
[struct stat="OK", time=4]
Resampling f673n
[struct stat="OK", time=5]
Resampling fq674n
[struct stat="OK", time=4]
#+end_example
*** DONE [2/2] Crop MUSE image to the WFC3 field
CLOSED: [2015-10-15 Thu 12:05]
+ [X] This is the final step required before we can do things like take ratio maps or calculate 2d histogram images
+ [X] [2015-10-15 Thu] Also, write out the integrated spectrum times filter throughput for the cropped region
#+BEGIN_SRC python :tangle crop_muse.py
  import sys
  import numpy as np
  from astropy.io import fits
  from astropy.wcs import WCS, WCSSUB_SPECTRAL
  import astropy.units as u

  def crop_muse_to_wfc3(fid):
      """Cut out a section of the MUSE image to match the WFC3 field"""
      wname = 'wfc3-resample-muse-{}.fits'.format(fid)
      mname = 'muse-hr-image-wfc3-{}.fits'.format(fid)
      whdu = fits.open(wname)[0]
      mhdu = fits.open(mname)['DATA']
      # Also get the spectral data cube multiplied by filter throughput
      shdu = fits.open(mname.replace('-image-', '-transwin-'))['DATA']
      wcs_w = WCS(whdu.header).celestial
      wcs_m = WCS(mhdu.header).celestial
      # Check that the two images have the same reference point in RA, DEC
      assert np.all(wcs_w.wcs.crval == wcs_m.wcs.crval)
      # And that the pixel scales are the same
      assert np.all(wcs_w.wcs.cdelt == wcs_m.wcs.cdelt)
      assert np.all(wcs_w.wcs.pc == wcs_m.wcs.pc)

      # The shapes of the two grids: (nx, ny) in FITS axis order
      shape_w = np.array([whdu.header['NAXIS1'], whdu.header['NAXIS2']])
      shape_m = np.array([mhdu.header['NAXIS1'], mhdu.header['NAXIS2']])

      # The difference in CRPIX values tells us the start indices (i, j)
      # for the crop window on the MUSE grid. Note that this is in
      # zero-based array indices
      start = wcs_m.wcs.crpix - wcs_w.wcs.crpix
      # The stop indices for the crop window 
      stop = start + shape_w

      # Shift 1 pixel to the right to do a coarse alignment correction
      start[0] += 1
      stop[0] += 1

      # Check that these are within bounds of the original MUSE grid
      assert np.all(start >= 0.0)
      assert np.all(stop < shape_m)

      # Crop the MUSE data array to the start:stop indices, remembering
      # that python axis order is backwards with respect to FITS axis
      # order
      mhdu.data = mhdu.data[start[1]:stop[1], start[0]:stop[0]]

      # And copy the WFC3 wcs into the new MUSE header
      mhdu.header.update(wcs_w.to_header())

      # Write out the new cropped MUSE image
      oname = mname.replace('-image-', '-cropimage-')
      mhdu.writeto(oname, clobber=True)

      # Finally, as a bonus, calculate the 1-D average spectrum from the cube
      spec = np.nanmean(shdu.data[:, start[1]:stop[1], start[0]:stop[0]], axis=(-1, -2))

      # Convert from 1e-20 flux-per-pixel to surface brightness units (flux per sr)
      pixel_area_sr = np.product(np.abs(wcs_m.wcs.cdelt))*(u.deg.to(u.radian))**2
      spec *= 1e-20/pixel_area_sr
      # extract only the spectral part of the cube's WCS
      wcs_s = WCS(shdu.header).sub([WCSSUB_SPECTRAL])
      oshdu = fits.PrimaryHDU(header=wcs_s.to_header(), data=spec)
      oshdu.header['BUNIT'] = 'erg/s/cm**2/sr/Angstrom'
      # Fix up the wavelngth units to angstrom
      oshdu.header['CDELT1'] *= 1e10
      oshdu.header['CRVAL1'] *= 1e10
      oshdu.header['CUNIT1'] = 'Angstrom'
      # And record the window from the MUSE full field that was extracted
      oshdu.header['MUSE_X1'] = start[0] + 1, 'Extracted window: start X pixel' 
      oshdu.header['MUSE_X2'] = stop[0] + 1, 'Extracted window: stop X pixel' 
      oshdu.header['MUSE_Y1'] = start[1] + 1, 'Extracted window: start Y pixel' 
      oshdu.header['MUSE_Y2'] = stop[0] + 1, 'Extracted window: stop Y pixel' 
      oshdu.writeto(mname.replace('-image-', '-cropspec1d-'), clobber=True)

      return oname


  if __name__ == '__main__':
      try:
          filter_id = sys.argv[1]
      except:
          print('Usage:', sys.argv[0], 'FILTER')

      print(crop_muse_to_wfc3(filter_id))

#+END_SRC

#+BEGIN_SRC sh :results silent
python crop_muse.py f547m
#+END_SRC

#+BEGIN_SRC sh :results verbatim
  FILTERS="f469n f487n f502n f547m fq575n f656n f658n fq672n f673n fq674n"
  for f in $FILTERS; do
      time python crop_muse.py $f
  done
#+END_SRC

#+RESULTS:
#+begin_example
muse-hr-cropimage-wfc3-f469n.fits
muse-hr-cropimage-wfc3-f487n.fits
muse-hr-cropimage-wfc3-f502n.fits
muse-hr-cropimage-wfc3-f547m.fits
muse-hr-cropimage-wfc3-fq575n.fits
muse-hr-cropimage-wfc3-f656n.fits
muse-hr-cropimage-wfc3-f658n.fits
muse-hr-cropimage-wfc3-fq672n.fits
muse-hr-cropimage-wfc3-f673n.fits
muse-hr-cropimage-wfc3-fq674n.fits
#+end_example
*** Two-d histogram of WFC3 vs MUSE-predicted count rates

#+BEGIN_SRC python :tangle histocalib.py
  from __future__ import print_function
  import numpy as np
  from astropy.io import fits
  from astropy.convolution import convolve, Gaussian2DKernel
  from matplotlib import pyplot as plt
  import seaborn as sns
  from specplot1d_utils import plot_1d_spec_from_fits

  maxcount = {
      "fq575n": 0.4,
      "fq672n": 0.6,
      "fq674n": 0.75,
      "f673n" : 2.5,
      "f469n" : 0.5,
      "f487n" : 10.0,
      "f656n" : 40.0, 
      "f658n" : 11.0, 
      "f547m" : 7.0, 
      "f502n" : 20.0,
  }
  GAMMA = 2.0

  cmap = sns.light_palette((260, 50, 30), input="husl", as_cmap=True)
  # cmap = plt.cm.gray_r

  def histogram_calib_images(f, vmax=1.0):
      name1 = 'wfc3-resample-muse-{}.fits'.format(f)
      name2 = 'muse-hr-cropimage-wfc3-{}.fits'.format(f)
      pltname = 'wfc3-vs-muse-calib-{}.pdf'.format(f)
      hdu1 = fits.open(name1)[0]
      hdu2 = fits.open(name2)['DATA']
      hduc = fits.open('wfc3-resample-muse-f547m.fits')[0]
      x, y = hdu2.data, hdu1.data
      xmin, xmax = ymin, ymax = 0.0, vmax
      ew = y/hduc.data
      # mask out silly values
      m = np.isfinite(x) & np.isfinite(y/x) & (np.abs(np.log10(y/x)) < 1.0)
      H, xedges, yedges = np.histogram2d(x[m], y[m], 200,
                                         [[xmin, xmax], [ymin, ymax]],
                                         weights=y[m])
      # Fit a straight line
      mm = m & (x > 0.05*xmax) & (y > 0.05*ymax) & (x < 0.5*xmax) & (y < 0.5*ymax) & (np.abs(np.log10(y/x)) < 0.3)
      # First, linear fit y(x) = m x + c
      y_x_linfit = np.polyfit(x[mm], y[mm], 1, w=y[mm])
      # Second, linear fit x(y) = m y + c
      x_y_linfit = np.polyfit(y[mm], x[mm], 1, w=y[mm])
      # Convert this from x(y) -> y(x)
      # If x = m y + c, then y = (1/m) x - c/m
      y_x_altfit = np.array([1./x_y_linfit[0], -x_y_linfit[1]/x_y_linfit[0]])
      # Take average and spread of these two fits
      y_x_bestfit = 0.5*(y_x_linfit + y_x_altfit)
      y_x_errfit = 0.5*np.abs(y_x_linfit - y_x_altfit)

      pbest =  np.poly1d(y_x_bestfit)

      # H = convolve(H, Gaussian2DKernel(1.0))
      fitcolor = (1.0, 0.5, 0.0)
      fitlabel = "y = ({:.2f} +/- {:.2f}) x + ({:.2f} +/- {:.2f})".format(
          y_x_bestfit[0], y_x_errfit[0], y_x_bestfit[1], y_x_errfit[1])
      fig, ax = plt.subplots(1, 1)
      ax.imshow((H.T)**(1.0/GAMMA), extent=[xmin, xmax, ymin, ymax],
                interpolation='none', aspect='auto', origin='lower', 
                cmap=cmap, alpha=1.0)
      ax.plot([0.0, x[m].max()], [0.0, x[m].max()], '-', alpha=1.0,
              lw=1, c='w', label=None)
      ax.plot([0.0, x[m].max()], pbest([0.0, x[m].max()]), '-', alpha=1.0,
              lw=1, c=fitcolor, label=fitlabel)

      leg = ax.legend(loc='upper left', title='Linear Fit', frameon=True, fancybox=True)
      leg.get_title().set_fontsize('small')
      ax.set_ylabel(
          'Observed WFC3 {} count rate, electron/s/pixel'.format(f.upper()))
      ax.set_xlabel(
          'MUSE-predicted WFC3 {} count rate, electron/s/pixel'.format(f.upper()))
      ax.set_xlim(xmin, xmax)
      ax.set_ylim(ymin, ymax)

      # Now do 1-D histogram of the deviations from the model
      ratio = y/pbest(x)
      if f == 'f547m':
          # Divide into high and low continuum counts
          s = 'counts'
          mlo = (y < y[m].mean()) & m
          mhi = (y >= y[m].mean()) & m
      else:
          # Divide into high and low EW
          s = f.upper() + '/F547M'
          mlo = (ew < np.median(ew[m])) & m
          mhi = (ew >= np.median(ew[m])) & m

      assert mlo.sum() > 0, f
      
      # inset axis at the top left
      ax2 = fig.add_axes([0.2, 0.55, 0.25, 0.25])
      ax2.hist(ratio[mlo], bins=100, range=(0.5, 1.5),
               normed=True, weights=y[mlo], alpha=0.7, label='Low '+s)
      ax2.hist(ratio[mhi], bins=100, range=(0.5, 1.5),
               normed=True, weights=y[mhi], color='red', alpha=0.3, label='High '+s)
      ax2.set_xlim(0.5, 1.5)
      # leave more space at top
      y1, y2 = ax2.get_ylim()
      y2 *= 1.2
      ax2.set_ylim(y1, y2)
      ax2.legend(loc='upper left', fontsize='xx-small')
      ax2.tick_params(labelleft=False, labelsize='x-small')
      ax2.set_xlabel('(Observed Counts) / (Linear Fit)', fontsize='xx-small')
      ax2.set_ylabel('Weighted PDF Histograms', fontsize='xx-small')
  #    ax2.set_title('PDF', fontsize='x-small')

      # inset axis at the bottom right
      ax3 = fig.add_axes([0.6, 0.2, 0.3, 0.3])
      fn = 'muse-hr-cropspec1d-wfc3-{}.fits'.format(f)
      plot_1d_spec_from_fits(fn, ax3, fontsize='xx-small')
      ax3.tick_params(labelsize='xx-small')
      ax3.set_title(f.upper())


      fig.set_size_inches(7, 7)
      fig.savefig(pltname)

      return [pltname, fitlabel]


  if __name__ == '__main__':
      for f, vmax in maxcount.items():
          print(histogram_calib_images(f, vmax))

#+END_SRC

#+RESULTS:


#+BEGIN_SRC sh
python histocalib.py 
#+END_SRC

#+RESULTS:
| ['wfc3-vs-muse-calib-f487n.pdf'  | 'y = (0.99 +/- 0.01) x + (-0.02 +/- 0.02)'] |
| ['wfc3-vs-muse-calib-f658n.pdf'  | 'y = (1.00 +/- 0.01) x + (-0.02 +/- 0.02)'] |
| ['wfc3-vs-muse-calib-f469n.pdf'  | 'y = (0.94 +/- 0.03) x + (-0.00 +/- 0.01)'] |
| ['wfc3-vs-muse-calib-fq674n.pdf' | 'y = (0.98 +/- 0.01) x + (0.01 +/- 0.00)']  |
| ['wfc3-vs-muse-calib-f656n.pdf'  | 'y = (1.02 +/- 0.01) x + (0.18 +/- 0.07)']  |
| ['wfc3-vs-muse-calib-fq672n.pdf' | 'y = (0.97 +/- 0.02) x + (0.01 +/- 0.00)']  |
| ['wfc3-vs-muse-calib-fq575n.pdf' | 'y = (1.00 +/- 0.02) x + (-0.00 +/- 0.00)'] |
| ['wfc3-vs-muse-calib-f673n.pdf'  | 'y = (0.97 +/- 0.01) x + (0.02 +/- 0.01)']  |
| ['wfc3-vs-muse-calib-f547m.pdf'  | 'y = (1.01 +/- 0.01) x + (-0.11 +/- 0.03)'] |
| ['wfc3-vs-muse-calib-f502n.pdf'  | 'y = (0.98 +/- 0.01) x + (-0.01 +/- 0.04)'] |


* TODO Multi-resolution MUSE line maps
+ This is stolen from a [[id:EAE1FA1C-7D1B-484D-9B4A-FF42DE7D8594][similar program for the Alba project]]
+ The difference is that we are starting from a simple image, not from a superposition of slits
+ Extra inspiration (e.g., star mask) is taken from [[id:B8D31952-3114-4FE8-B2D7-A0CC32287FA2][here]]
#+BEGIN_SRC python :tangle multibin-map.py
from __future__ import print_function
import sys
import numpy as np
sys.path.append('/Users/will/Work/RubinWFC3/Tsquared')
from rebin_utils import downsample, oversample
from astropy.io import fits

nlist = [1, 2, 4, 8, 16, 32, 64, 128, 256]
mingoods = [2, 2, 2, 2, 2, 2, 2, 2, 2]

try: 
    infile = sys.argv[1]
except:
    sys.exit('Usage: {} FITSFILE'.format(sys.argv[0]))


hdu = fits.open(infile)[0]
hdr = hdu.header
im = hdu.data
w = np.ones_like(hdu.data)

continuum = fits.open('muse-hr-image-wfc3-f547m.fits')['DATA'].data
starmask = continuum > 30
m =  np.isfinite(hdu.data) & (hdu.data > 0.0) & (~starmask)
for n, mingood in zip(nlist, mingoods):
    im[~m] = 0.0
    outfile = infile.replace('.fits', '-bin{:03d}.fits'.format(n))
    print('Saving', outfile)
    # Save both the scaled image and the weights, but at the full resolution
    fits.HDUList([
        fits.PrimaryHDU(),
        fits.ImageHDU(data=oversample(im, n), header=hdr, name='scaled'),
        fits.ImageHDU(data=oversample(w, n), header=hdr, name='weight'),
    ]).writeto(outfile, clobber=True)
    # Now do the rebinning by a factor of two
    [im,], m, w = downsample([im,], m, weights=w, mingood=mingood)


#+END_SRC

#+BEGIN_SRC sh :results verbatim
python multibin-map.py LineMaps/linesum-Cl_III-5538.fits
#+END_SRC

#+RESULTS:
: Saving LineMaps/linesum-Cl_III-5538-bin001.fits
: Saving LineMaps/linesum-Cl_III-5538-bin002.fits
: Saving LineMaps/linesum-Cl_III-5538-bin004.fits
: Saving LineMaps/linesum-Cl_III-5538-bin008.fits
: Saving LineMaps/linesum-Cl_III-5538-bin016.fits
: Saving LineMaps/linesum-Cl_III-5538-bin032.fits
: Saving LineMaps/linesum-Cl_III-5538-bin064.fits
: Saving LineMaps/linesum-Cl_III-5538-bin128.fits
: Saving LineMaps/linesum-Cl_III-5538-bin256.fits


Do them all
#+BEGIN_SRC sh :results verbatim
linelist=LineMaps/linesum-*[0-9][0-9][0-9][0-9].fits
for line in $linelist; do
    echo "Processing $line"
    time python multibin-map.py $line > ${line}-multibin.log
done
#+END_SRC

#+RESULTS:
#+begin_example
Processing LineMaps/linesum-Ar_III-5192.fits
Processing LineMaps/linesum-Ar_III-7136.fits
Processing LineMaps/linesum-Ar_III-7751.fits
Processing LineMaps/linesum-C_I-8727.fits
Processing LineMaps/linesum-C_II-5890.fits
Processing LineMaps/linesum-C_II-6578.fits
Processing LineMaps/linesum-Ca_I-9052.fits
Processing LineMaps/linesum-Ca_I-9095.fits
Processing LineMaps/linesum-Cl_II-8579.fits
Processing LineMaps/linesum-Cl_III-5518.fits
Processing LineMaps/linesum-Cl_III-5538.fits
Processing LineMaps/linesum-Cl_IV-8046.fits
Processing LineMaps/linesum-Fe_II-5262.fits
Processing LineMaps/linesum-Fe_II-6133.fits
Processing LineMaps/linesum-Fe_II-7453.fits
Processing LineMaps/linesum-Fe_II-8617.fits
Processing LineMaps/linesum-Fe_III-4658.fits
Processing LineMaps/linesum-Fe_III-4702.fits
Processing LineMaps/linesum-Fe_III-5270.fits
Processing LineMaps/linesum-H_I-4861.fits
Processing LineMaps/linesum-H_I-6563.fits
Processing LineMaps/linesum-H_I-8438.fits
Processing LineMaps/linesum-H_I-8467.fits
Processing LineMaps/linesum-H_I-8502.fits
Processing LineMaps/linesum-H_I-8545.fits
Processing LineMaps/linesum-H_I-8598.fits
Processing LineMaps/linesum-H_I-8665.fits
Processing LineMaps/linesum-H_I-8750.fits
Processing LineMaps/linesum-H_I-8863.fits
Processing LineMaps/linesum-H_I-9015.fits
Processing LineMaps/linesum-H_I-9229.fits
Processing LineMaps/linesum-He_I-5016.fits
Processing LineMaps/linesum-He_I-5048.fits
Processing LineMaps/linesum-He_I-5876.fits
Processing LineMaps/linesum-He_I-6678.fits
Processing LineMaps/linesum-He_I-7065.fits
Processing LineMaps/linesum-N_I-5199.fits
Processing LineMaps/linesum-N_I-8680.fits
Processing LineMaps/linesum-N_II-5755.fits
Processing LineMaps/linesum-N_II-5932.fits
Processing LineMaps/linesum-N_II-5942.fits
Processing LineMaps/linesum-N_II-5952.fits
Processing LineMaps/linesum-N_II-6548.fits
Processing LineMaps/linesum-N_II-6583.fits
Processing LineMaps/linesum-O_I-5577.fits
Processing LineMaps/linesum-O_I-6046.fits
Processing LineMaps/linesum-O_I-6300.fits
Processing LineMaps/linesum-O_I-6364.fits
Processing LineMaps/linesum-O_I-7002.fits
Processing LineMaps/linesum-O_I-8446.fits
Processing LineMaps/linesum-O_II-4650.fits
Processing LineMaps/linesum-O_II-7318.fits
Processing LineMaps/linesum-O_II-7330.fits
Processing LineMaps/linesum-O_III-4959.fits
Processing LineMaps/linesum-O_III-5007.fits
Processing LineMaps/linesum-S_II-6716.fits
Processing LineMaps/linesum-S_II-6731.fits
Processing LineMaps/linesum-S_III-6312.fits
Processing LineMaps/linesum-S_III-9069.fits
Processing LineMaps/linesum-Si_II-5041.fits
Processing LineMaps/linesum-Si_II-5056.fits
Processing LineMaps/linesum-Si_II-5958.fits
Processing LineMaps/linesum-Si_II-5979.fits
Processing LineMaps/linesum-Si_II-6347.fits
Processing LineMaps/linesum-Si_II-6371.fits
#+end_example


** Ratio of multibin maps
:PROPERTIES:
:ID:       125BB238-D032-4FAD-B6DA-FBFB14DAD3AF
:END:
#+name: ratio-pairs
+ N_II-5755;N_II-6583
+ S_III-6312;S_III-9069
+ Cl_III-5538;Cl_III-5518
+ S_II-6716;S_II-6731
+ H_I-6563;H_I-4861
+ H_I-4861;H_I-6563
+ H_I-6563;H_I-9229
+ H_I-8545;H_I-9229
+ H_I-8598;H_I-9229
+ H_I-8750;H_I-9229
+ H_I-8863;H_I-9229
+ H_I-9015;H_I-9229
+ O_II-7318;O_II-7330
+ He_I-5876;He_I-6678
+ Ar_III-7136;Ar_III-7751
+ O_I-7002;O_I-8446
+ Fe_III-4658;H_I-4861

What a palaver it is to deal with array variables in bash
#+name: ratio-multibin
#+BEGIN_SRC sh :var list=ratio-pairs :results verbatim
for pair in $list; do
    arr_pair=(${pair//;/ })
    echo ${arr_pair[0]} ${arr_pair[1]} 
    for binning in 001 002 004 008 016 032 064 128 256; do
        python muse_line_ratio.py ${arr_pair[0]} ${arr_pair[1]} linesum bin$binning > /dev/null
    done
done
#+END_SRC

#+RESULTS: ratio-multibin
#+begin_example
N_II-5755 N_II-6583
S_III-6312 S_III-9069
Cl_III-5538 Cl_III-5518
S_II-6716 S_II-6731
H_I-6563 H_I-4861
H_I-4861 H_I-6563
H_I-6563 H_I-9229
H_I-8545 H_I-9229
H_I-8598 H_I-9229
H_I-8750 H_I-9229
H_I-8863 H_I-9229
H_I-9015 H_I-9229
O_II-7318 O_II-7330
He_I-5876 He_I-6678
Ar_III-7136 Ar_III-7751
O_I-7002 O_I-8446
Fe_III-4658 H_I-4861
#+end_example

#+name: more-ratio-pairs
+ O_I-6300;O_I-8446
+ O_I-6300;O_II-7318
+ O_III-5007;O_II-7318
+ O_I-8446;O_II-7318
+ O_I-8446;H_I-8545
+ Ar_III-5192;Ar_III-7136 
+ Ar_III-7751;Ar_III-7136
+ Fe_III-4702;Fe_III-4658 
+ Fe_III-5270;Fe_III-4658 
+ O_III-5007;O_III-4959
+ N_II-6583;N_II-6548

#+call: ratio-multibin[:results output verbatim](list=more-ratio-pairs)

#+RESULTS:
: O_I-6300 O_I-8446
: O_I-6300 O_II-7318
: O_III-5007 O_II-7318
: O_I-8446 O_II-7318

#+name: yet-more-ratio-pairs
+ O_I-6364;O_I-6300
+ N_I-5199;O_I-8446
+ N_I-5199;O_I-7002
#+call: ratio-multibin[:results output verbatim](list=yet-more-ratio-pairs)

#+RESULTS:
: O_I-6364 O_I-6300
: N_I-5199 O_I-8446
: N_I-5199 O_I-7002



#+BEGIN_SRC sh :results verbatim
for binning in 001 002 004 008 016 032 064 128 256; do
    python muse_line_ratio.py N_II-5755 N_II-6583 linesum bin$binning 
done
#+END_SRC

#+RESULTS:
: LineMaps/linesum-N_II-5755-bin001.fits LineMaps/linesum-N_II-6583-bin001.fits
: LineMaps/linesum-N_II-5755-bin002.fits LineMaps/linesum-N_II-6583-bin002.fits
: LineMaps/linesum-N_II-5755-bin004.fits LineMaps/linesum-N_II-6583-bin004.fits
: LineMaps/linesum-N_II-5755-bin008.fits LineMaps/linesum-N_II-6583-bin008.fits
: LineMaps/linesum-N_II-5755-bin016.fits LineMaps/linesum-N_II-6583-bin016.fits
: LineMaps/linesum-N_II-5755-bin032.fits LineMaps/linesum-N_II-6583-bin032.fits
: LineMaps/linesum-N_II-5755-bin064.fits LineMaps/linesum-N_II-6583-bin064.fits
: LineMaps/linesum-N_II-5755-bin128.fits LineMaps/linesum-N_II-6583-bin128.fits
: LineMaps/linesum-N_II-5755-bin256.fits LineMaps/linesum-N_II-6583-bin256.fits


** Te - Ne distribution histograms
+ We want to get to the stuff in the ipynb file
+ Similar to other [[id:012A7F6B-BC6B-433E-A5A8-E1453B1E3FCA][histogram plot programs]]
+ But this does several different correlations
  + Te([N II]) vs Ne([S II])
  + Te([N II]) vs Te([S III])
  + Ne([S II]) vs Ne([Cl III])
  + Te([S III]) vs Ne([Cl III])


#+BEGIN_SRC python :tangle muse-Te-Ne-histograms.py
  from __future__ import print_function
  import sys
  import numpy as np
  from astropy.io import fits
  from matplotlib import pyplot as plt
  import pyregion
  t2dir = '/Users/will/Work/RubinWFC3/Tsquared'
  sys.path.append(t2dir)
  from pyneb_utils import rsii_T_den, rnii_T_den
  from misc_utils import sanitize_string


  try:
      region = sys.argv[1]
      suffix = sys.argv[2]
  except IndexError:
      sys.exit('Usage: {} REGION [SUFFIX]'.format(sys.argv[0]))

  file_patterns = {
      'T([N II])'  : 'muse-derived-Te-bin{}.fits',
      'N([S II])'  : 'muse-derived-Ne-bin{}.fits',
      'T([S III])' : 'muse-derived-Te-iii-bin{}.fits',
      'N([Cl III])': 'muse-derived-Ne-iii-bin{}.fits',
      'S(Pa 9)'    : 'linesum-H_I-9229-bin{}.fits',
      'S(5755)'    : 'linesum-N_II-5755-bin{}.fits',
      'S(6716)'    : 'linesum-S_II-6716-bin{}.fits',
      'S(6312)'    : 'linesum-S_III-6312-bin{}.fits',
      'S(5518)'    : 'linesum-Cl_III-5518-bin{}.fits',
  }

  minmax = {
      'T([N II])'  : [5000.0, 15000.],
      'N([S II])'  : [100.0, 1e5],
      'T([S III])' : [5000.0, 15000.], 
      'N([Cl III])': [100.0, 1e5],
      'S(Pa 9)'    : [0.01, 8.0],
      'S(5755)'    : [0.01, 8.0],
      'S(6716)'    : [0.01, 8.0],
      'S(6312)'    : [0.01, 8.0],
      'S(5518)'    : [0.01, 8.0],
  }



  hdus = {k: fits.open('Linemaps/' + v.format(suffix))['SCALED']
          for k, v in file_patterns.items()}

  # Rescale brightnesses to give nicer numbers
  for k in hdus:
      if k.startswith('S'):
          hdus[k].data /= 1.e5

  pairs = [
      ['T([N II])', 'T([S III])'],
      ['N([S II])', 'N([Cl III])'],
      ['N([S II])', 'T([N II])'],
      ['N([Cl III])', 'T([S III])'],
      # ['S(Pa 9)', 'N([S II])'],
      # ['S(Pa 9)', 'N([Cl III])'],
      # ['S(Pa 9)', 'T([N II])'],
      # ['S(Pa 9)', 'T([S III])'],
      ['S(6716)', 'N([S II])'],
      ['S(5518)', 'N([Cl III])'],
      ['S(5755)', 'T([N II])'],
      ['S(6312)', 'T([S III])'],
  ]

  # Pairs that need to know about each other because of co-dependent ratios
  complements = {
      'N([S II])': 'T([N II])', 
      'T([N II])': 'N([S II])', 
      'N([Cl III])': 'T([S III])', 
      'T([S III])': 'N([Cl III])', 
  }

  weighting_maps = {
      'N([S II])': 'S(6716)', 
      'T([N II])': 'S(5755)', 
      'N([Cl III])': 'S(5518)', 
      'T([S III])': 'S(6312)', 
  }

  mm = np.isfinite(hdus['S(Pa 9)'].data) & (hdus['S(Pa 9)'].data > 0.0) 
  if 'sweet' in region.lower():
      title = 'Orion S'
      include = pyregion.open(t2dir + '/will-nii-sweet-spot-wcs.reg')
      exclude = pyregion.open(t2dir + '/will-nii-exclude-wcs.reg')
      mm = mm & include.get_mask(hdu=hdus['S(Pa 9)']) & (~exclude.get_mask(hdu=hdus['S(Pa 9)']))

      include = pyregion.open(t2dir + '/will-sii-sweet-spot-wcs.reg')
      exclude = pyregion.open(t2dir + '/will-sii-exclude-wcs.reg')
      mm = mm & include.get_mask(hdu=hdus['S(Pa 9)']) & (~exclude.get_mask(hdu=hdus['S(Pa 9)']))
  else:
      title = 'Full nebula'


  for xlabel, ylabel in pairs:
      hduA = hdus[xlabel]
      hduB = hdus[ylabel]
      xmin, xmax = minmax[xlabel]
      ymin, ymax = minmax[ylabel]

      m = mm & np.isfinite(hduA.data) & np.isfinite(hduB.data)
      m = m & (hduA.data > xmin) & (hduB.data > ymin) 
      m = m & (hduA.data < xmax) & (hduB.data < ymax) 

      wlabels = []
      for label in xlabel, ylabel:
          # Make a list of quantities to use as weights for this map
          if label in weighting_maps:
              wlabels.append(weighting_maps[label])
          else:
              wlabels.append(label)
          # Also check complementary vars for being out-of-range
          if label in complements:
              zlabel = complements[label]
              zmin, zmax = minmax[zlabel]
              hduC = hdus[zlabel]
              m = m & (hduC.data > zmin) & (hduC.data < zmax)

      x = hduA.data[m]
      y = hduB.data[m]
      w = np.zeros_like(x)
      for wlabel in set(wlabels):
          w += hdus[wlabel].data[m]
      gamma = 1.5
      fig, ax = plt.subplots(1, 1)
      # Use a log scale for surface brightnesses and densities
      if xlabel.startswith('S') or xlabel.startswith('N'):
          x = np.log10(x)
          xmin, xmax = np.log10(xmin), np.log10(xmax)
          xlabel = 'log10[ {} ]'.format(xlabel)
      if ylabel.startswith('S') or ylabel.startswith('N'):
          y = np.log10(y)
          ymin, ymax = np.log10(ymin), np.log10(ymax)
          ylabel = 'log10[ {} ]'.format(ylabel)
      H, xedges, yedges = np.histogram2d(x, y, 50,
                                         [[xmin, xmax], [ymin, ymax]],
                                         weights=w)
      ax.imshow((H.T)**(1.0/gamma), extent=[xmin, xmax, ymin, ymax],
                interpolation='nearest', aspect='auto', origin='lower', 
                cmap=plt.cm.gray_r, alpha=1.0)

      ax.set_xlim(xmin, xmax)
      ax.set_ylim(ymin, ymax)
      ax.set_xlabel(xlabel)
      ax.set_ylabel(ylabel)
      ax.grid()

      fig.set_size_inches(4, 4)
      fig.tight_layout()
      pltfile = 'muse-{}-{}-histogram-{}{}.pdf'.format(sanitize_string(xlabel),
                                                       sanitize_string(ylabel),
                                                       region, suffix)

      fig.savefig(pltfile)
      print(pltfile)

#+END_SRC


#+BEGIN_SRC sh :results verbatim
source activate py27
for bin in 001 004 016 064; do
    python muse-Te-Ne-histograms.py full $bin
done
#+END_SRC

#+RESULTS:
#+begin_example
muse-T_N_II-T_S_III-histogram-full001.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-full001.pdf
muse-log10_N_S_II_-T_N_II-histogram-full001.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-full001.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-full001.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-full001.pdf
muse-log10_S_5755_-T_N_II-histogram-full001.pdf
muse-log10_S_6312_-T_S_III-histogram-full001.pdf
muse-T_N_II-T_S_III-histogram-full004.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-full004.pdf
muse-log10_N_S_II_-T_N_II-histogram-full004.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-full004.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-full004.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-full004.pdf
muse-log10_S_5755_-T_N_II-histogram-full004.pdf
muse-log10_S_6312_-T_S_III-histogram-full004.pdf
muse-T_N_II-T_S_III-histogram-full016.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-full016.pdf
muse-log10_N_S_II_-T_N_II-histogram-full016.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-full016.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-full016.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-full016.pdf
muse-log10_S_5755_-T_N_II-histogram-full016.pdf
muse-log10_S_6312_-T_S_III-histogram-full016.pdf
muse-T_N_II-T_S_III-histogram-full064.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-full064.pdf
muse-log10_N_S_II_-T_N_II-histogram-full064.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-full064.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-full064.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-full064.pdf
muse-log10_S_5755_-T_N_II-histogram-full064.pdf
muse-log10_S_6312_-T_S_III-histogram-full064.pdf
#+end_example



#+RESULTS:
#+BEGIN_SRC sh
open muse-log10_S_5518_-log10_N_Cl_III_-histogram-full???.pdf
open muse-log10_S_6312_-T_S_III-histogram-full???.pdf
open muse-log10_S_6716_-log10_N_S_II_-histogram-full???.pdf
open muse-log10_S_5755_-T_N_II-histogram-full???.pdf
#+END_SRC

#+BEGIN_SRC sh
open muse-log10_N_S_II_-log10_N_Cl_III_-histogram-full???.pdf
open muse-T_N_II-T_S_III-histogram-full???.pdf
open muse-log10_N_S_II_-T_N_II-histogram-full???.pdf
open muse-log10_N_Cl_III_-T_S_III-histogram-full???.pdf
#+END_SRC

#+RESULTS:

#+RESULTS:

#+BEGIN_SRC sh :results verbatim
source activate py27
for bin in 001 004 016 064; do
    python muse-Te-Ne-histograms.py sweet $bin
done
#+END_SRC

#+RESULTS:
#+begin_example
muse-T_N_II-T_S_III-histogram-sweet001.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-sweet001.pdf
muse-log10_N_S_II_-T_N_II-histogram-sweet001.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-sweet001.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-sweet001.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-sweet001.pdf
muse-log10_S_5755_-T_N_II-histogram-sweet001.pdf
muse-log10_S_6312_-T_S_III-histogram-sweet001.pdf
muse-T_N_II-T_S_III-histogram-sweet004.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-sweet004.pdf
muse-log10_N_S_II_-T_N_II-histogram-sweet004.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-sweet004.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-sweet004.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-sweet004.pdf
muse-log10_S_5755_-T_N_II-histogram-sweet004.pdf
muse-log10_S_6312_-T_S_III-histogram-sweet004.pdf
muse-T_N_II-T_S_III-histogram-sweet016.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-sweet016.pdf
muse-log10_N_S_II_-T_N_II-histogram-sweet016.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-sweet016.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-sweet016.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-sweet016.pdf
muse-log10_S_5755_-T_N_II-histogram-sweet016.pdf
muse-log10_S_6312_-T_S_III-histogram-sweet016.pdf
muse-T_N_II-T_S_III-histogram-sweet064.pdf
muse-log10_N_S_II_-log10_N_Cl_III_-histogram-sweet064.pdf
muse-log10_N_S_II_-T_N_II-histogram-sweet064.pdf
muse-log10_N_Cl_III_-T_S_III-histogram-sweet064.pdf
muse-log10_S_6716_-log10_N_S_II_-histogram-sweet064.pdf
muse-log10_S_5518_-log10_N_Cl_III_-histogram-sweet064.pdf
muse-log10_S_5755_-T_N_II-histogram-sweet064.pdf
muse-log10_S_6312_-T_S_III-histogram-sweet064.pdf
#+end_example


#+BEGIN_SRC sh
open muse-log10_S_5518_-log10_N_Cl_III_-histogram-sweet???.pdf
open muse-log10_S_6312_-T_S_III-histogram-sweet???.pdf
open muse-log10_S_6716_-log10_N_S_II_-histogram-sweet???.pdf
open muse-log10_S_5755_-T_N_II-histogram-sweet???.pdf
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh
open muse-S_Pa_9-T_S_III-histogram-sweet???.pdf
#+END_SRC

#+RESULTS:

*** HR cube
:PROPERTIES:
:TABLE_EXPORT_FILE: wavsec-startwavs.tab
:TABLE_EXPORT_FORMAT: orgtbl-to-tsv
:ID:       C2108CD1-EF28-4F63-9CA1-B7F9DA59C450
:END:
+ Exactly the same, except that NV = 5614
  + Wavelength scale: 0.85 angstroms
  + CRPIX3 = 1
  + CRVAL3 = 4595.
+ First try at dividing it up: do it by wavelength
  + Divide into 8 parts of length 702
    + Last one will be 700
  + Size will be 0.702 1.476 1.766 4 = 7.32 GB




#+name: wavsec-startwavs
| Section |  CRVAL3 |
|---------+---------|
|       0 | 4595.00 |
|       1 | 5191.70 |
|       2 | 5788.40 |
|       3 | 6385.10 |
|       4 | 6981.80 |
|       5 | 7578.50 |
|       6 | 8175.20 |
|       7 | 8771.90 |
#+TBLFM: $2=4595.0 + 0.85 702 $1 ;f2

#+BEGIN_SRC python :tangle muse_divide_cube_in_sections.py
  import sys
  from astropy.io import fits
  from astropy import wcs
  import numpy as np

  try:
      quantity = sys.argv[1]
      assert quantity in ['data', 'variance']
  except (IndexError, AssertionError) as e:
      sys.exit('Usage: {} (data|variance)'.format(sys.argv[0]))


  if quantity == 'variance':
      cubename = 'STAT'
  else:
      cubename = 'DATA'
    
  hdulist = fits.open('DATA/DATACUBEFINALuser_20140216T010259_78380e1d.fits')
  cube = hdulist[cubename]
  sections = np.arange(8, dtype=int)
  NV = 702
  k1_list = sections*NV
  k2_list = k1_list + NV
  wav0_list = cube.header['CRVAL3'] + cube.header['CD3_3']*NV*sections
  for section, k1, k2, wav0 in zip(sections, k1_list, k2_list, wav0_list):
      fn = 'muse-hr-{}-wavsec{}.fits'.format(quantity, section)
      hdr = cube.header.copy()
      hdr['CRVAL3'] = wav0
      hdr['NAXIS3'] = NV
      print('Writing', fn)
      fits.PrimaryHDU(header=hdr, data=cube.data[k1:k2]).writeto(fn, clobber=True)


#+END_SRC


+ That version is having problems with the later sections - memory usage is increasing, which is not good. 
+ So I will try a version that does only one section and then stops
+ Actually it looks like it is OK, so I won't need this version
  + Turns out that =watch ls -l PATTERN= only matches =PATTERN= once at the start, so any new files don't show up.  Better to use =watch -d ls -lth=
+ It takes 3 to 5 min per section to extract
+ File transfer to hypatia takes 8 min per section, so that is the limiting factor
#+BEGIN_SRC python :tangle muse_divide_and_conquer.py
  import sys
  from astropy.io import fits
  from astropy import wcs
  import numpy as np

  sections = np.arange(8, dtype=int)
  NV = 702
  k1_list = sections*NV
  k2_list = k1_list + NV

  try:
      quantity = sys.argv[1]
      section = int(sys.argv[2])
      assert quantity in ['data', 'variance']
      assert section in sections
  except (IndexError, AssertionError) as e:
      sys.exit('Usage: {} (data|variance) SECTION'.format(sys.argv[0]))


  if quantity == 'variance':
      cubename = 'STAT'
  else:
      cubename = 'DATA'
  
  hdulist = fits.open('DATA/DATACUBEFINALuser_20140216T010259_78380e1d.fits')
  cube = hdulist[cubename]

  wav0_list = cube.header['CRVAL3'] + cube.header['CD3_3']*NV*sections

  k1, k2, wav0 = k1_list[section], k2_list[section], wav0_list[section]
  fn = 'muse-hr-{}-wavsec{}.fits'.format(quantity, section)
  hdr = cube.header.copy()
  hdr['CRVAL3'] = wav0
  hdr['NAXIS3'] = NV
  print('Writing', fn)
  fits.PrimaryHDU(header=hdr, data=cube.data[k1:k2]).writeto(fn, clobber=True)


#+END_SRC
*** Ship all python files to server
#+BEGIN_SRC sh :results verbatim
rsync -avzP *.py nil:/fs/nil/other0/will/orion-muse
date
#+END_SRC

#+RESULTS:
: building file list ... 
:  0 files...26 files to consider
: muse_divide_cube_in_sections.py
:          922 100%    0.00kB/s    0:00:00         922 100%    0.00kB/s    0:00:00 (xfer#1, to-check=7/26)
: 
: sent 1202 bytes  received 54 bytes  2512.00 bytes/sec
: total size is 49553  speedup is 39.45
: Thu Oct 29 10:37:00 CST 2015

